```digitalocean_firewall.main: Refreshing state... [id=83dc9b06-d529-4fba-9b20-9c425fd474cd]
aws_kms_key.encryption_key: Refreshing state... [id=ccd23c99-9272-49bb-a20e-04b223695683]
aws_s3_bucket.tf-management-trail: Refreshing state... [id=tf-management-trail]
aws_iam_role.dev_instance_role: Refreshing state... [id=dev_instance_role]
aws_s3_bucket.tf-backend: Refreshing state... [id=tf-backend-abhishek]
data.aws_ami.centos_arm64: Reading...
aws_dynamodb_table.tf-state-lock: Refreshing state... [id=tf-state-lock]
data.aws_ami.centos_x86: Reading...
aws_security_group.main: Refreshing state... [id=sg-06aba332b2d3d09ea]
aws_iam_role.github_oidc_role: Refreshing state... [id=github_oidc_role]
data.aws_ami.centos_x86: Read complete after 0s [id=ami-01f5f4a6f36c4af6a]
data.aws_ami.centos_arm64: Read complete after 0s [id=ami-050f358d5ef71d8a8]
aws_s3_bucket_policy.tf-management-trail-policy: Refreshing state... [id=tf-management-trail]
aws_cloudtrail.management[0]: Refreshing state... [id=tf-trail-management]
aws_s3_bucket_policy.tf-backend-policy: Refreshing state... [id=tf-backend-abhishek]
aws_s3_bucket_public_access_block.tf-backend-public-access-block: Refreshing state... [id=tf-backend-abhishek]
aws_s3_bucket_logging.tf-backend-logging: Refreshing state... [id=tf-management-trail]
aws_iam_instance_profile.dev_instance_profile: Refreshing state... [id=test_profile]
aws_iam_role_policy_attachment.secrets_manager_policy_attachment: Refreshing state... [id=dev_instance_role-20210925181828900900000002]
aws_iam_role_policy_attachment.s3_policy_attachment: Refreshing state... [id=dev_instance_role-20210925181828891000000001]

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # aws_iam_policy.github_oidc_policy will be created
  + resource "aws_iam_policy" "github_oidc_policy" {
      + arn       = (known after apply)
      + id        = (known after apply)
      + name      = "github_oidc_policy"
      + path      = "/"
      + policy    = jsonencode(
            {
              + Statement = [
                  + {
                      + Action   = [
                          + "secretsmanager:GetSecretValue",
                          + "sts:AssumeRole",
                          + "s3:PutObject",
                          + "s3:GetObject",
                          + "s3:DeleteObjectVersion",
                          + "s3:ListBucket",
                          + "s3:DeleteObject",
                          + "s3:PutObjectAcl",
                        ]
                      + Effect   = "Allow"
                      + Resource = [
                          + "*",
                        ]
                    },
                ]
              + Version   = "2012-10-17"
            }
        )
      + policy_id = (known after apply)
      + tags_all  = (known after apply)
    }

  # aws_s3_bucket_logging.tf-backend-logging will be created
  + resource "aws_s3_bucket_logging" "tf-backend-logging" {
      + bucket        = "tf-management-trail"
      + id            = (known after apply)
      + target_bucket = "tf-backend-abhishek"
      + target_prefix = "log/"
    }

Plan: 2 to add, 0 to change, 0 to destroy.

─────────────────────────────────────────────────────────────────────────────

Saved the plan to: CURRENTPLAN.tfplan

To perform exactly these actions, run the following command to apply:
    terraform apply "CURRENTPLAN.tfplan"
```